###################################################################

# Created by write_sdc on Wed May 8 23:41:19 2019

###################################################################
set sdc_version 1.2

create_clock -name clk  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.5  [get_ports {a[15]}]
set_input_delay -clock clk  0.5  [get_ports {a[14]}]
set_input_delay -clock clk  0.5  [get_ports {a[13]}]
set_input_delay -clock clk  0.5  [get_ports {a[12]}]
set_input_delay -clock clk  0.5  [get_ports {a[11]}]
set_input_delay -clock clk  0.5  [get_ports {a[10]}]
set_input_delay -clock clk  0.5  [get_ports {a[9]}]
set_input_delay -clock clk  0.5  [get_ports {a[8]}]
set_input_delay -clock clk  0.5  [get_ports {a[7]}]
set_input_delay -clock clk  0.5  [get_ports {a[6]}]
set_input_delay -clock clk  0.5  [get_ports {a[5]}]
set_input_delay -clock clk  0.5  [get_ports {a[4]}]
set_input_delay -clock clk  0.5  [get_ports {a[3]}]
set_input_delay -clock clk  0.5  [get_ports {a[2]}]
set_input_delay -clock clk  0.5  [get_ports {a[1]}]
set_input_delay -clock clk  0.5  [get_ports {a[0]}]
set_input_delay -clock clk  0.5  [get_ports {b[15]}]
set_input_delay -clock clk  0.5  [get_ports {b[14]}]
set_input_delay -clock clk  0.5  [get_ports {b[13]}]
set_input_delay -clock clk  0.5  [get_ports {b[12]}]
set_input_delay -clock clk  0.5  [get_ports {b[11]}]
set_input_delay -clock clk  0.5  [get_ports {b[10]}]
set_input_delay -clock clk  0.5  [get_ports {b[9]}]
set_input_delay -clock clk  0.5  [get_ports {b[8]}]
set_input_delay -clock clk  0.5  [get_ports {b[7]}]
set_input_delay -clock clk  0.5  [get_ports {b[6]}]
set_input_delay -clock clk  0.5  [get_ports {b[5]}]
set_input_delay -clock clk  0.5  [get_ports {b[4]}]
set_input_delay -clock clk  0.5  [get_ports {b[3]}]
set_input_delay -clock clk  0.5  [get_ports {b[2]}]
set_input_delay -clock clk  0.5  [get_ports {b[1]}]
set_input_delay -clock clk  0.5  [get_ports {b[0]}]
set_output_delay -clock clk  0.5  [get_ports {c[31]}]
set_output_delay -clock clk  0.5  [get_ports {c[30]}]
set_output_delay -clock clk  0.5  [get_ports {c[29]}]
set_output_delay -clock clk  0.5  [get_ports {c[28]}]
set_output_delay -clock clk  0.5  [get_ports {c[27]}]
set_output_delay -clock clk  0.5  [get_ports {c[26]}]
set_output_delay -clock clk  0.5  [get_ports {c[25]}]
set_output_delay -clock clk  0.5  [get_ports {c[24]}]
set_output_delay -clock clk  0.5  [get_ports {c[23]}]
set_output_delay -clock clk  0.5  [get_ports {c[22]}]
set_output_delay -clock clk  0.5  [get_ports {c[21]}]
set_output_delay -clock clk  0.5  [get_ports {c[20]}]
set_output_delay -clock clk  0.5  [get_ports {c[19]}]
set_output_delay -clock clk  0.5  [get_ports {c[18]}]
set_output_delay -clock clk  0.5  [get_ports {c[17]}]
set_output_delay -clock clk  0.5  [get_ports {c[16]}]
set_output_delay -clock clk  0.5  [get_ports {c[15]}]
set_output_delay -clock clk  0.5  [get_ports {c[14]}]
set_output_delay -clock clk  0.5  [get_ports {c[13]}]
set_output_delay -clock clk  0.5  [get_ports {c[12]}]
set_output_delay -clock clk  0.5  [get_ports {c[11]}]
set_output_delay -clock clk  0.5  [get_ports {c[10]}]
set_output_delay -clock clk  0.5  [get_ports {c[9]}]
set_output_delay -clock clk  0.5  [get_ports {c[8]}]
set_output_delay -clock clk  0.5  [get_ports {c[7]}]
set_output_delay -clock clk  0.5  [get_ports {c[6]}]
set_output_delay -clock clk  0.5  [get_ports {c[5]}]
set_output_delay -clock clk  0.5  [get_ports {c[4]}]
set_output_delay -clock clk  0.5  [get_ports {c[3]}]
set_output_delay -clock clk  0.5  [get_ports {c[2]}]
set_output_delay -clock clk  0.5  [get_ports {c[1]}]
set_output_delay -clock clk  0.5  [get_ports {c[0]}]
